insert into product
    (title, description, image, price)
values
    ('ИС-6', 'Мощный советский тяжелый танк', '/img/IS-6.jpg', '10 000'),
    ('Löwe', 'Немецкий тяжелый премиум-танк', '/img/LOWE.jpg', '12,500'),
    ('T34', 'Американский тяжелый премиум-танк', '/img/t-34-america.jpg', '11,000'),
    ('AMX M4 49', 'Французский тяжелый премиум-танк', '/img/AMX M4 49.jpg', '9,800'),
    ('Skorpion G', 'Немецкая ПТ-САУ премиум-класса', '/img/Skorpion G.jpg', '11,500'),
    ('Progetto 46', 'Итальянский средний премиум-танк', '/img/Progetto 46.jpg', '10,500'),
    ('Type 59', 'Легендарный китайский средний танк', '/img/Type 59.jpg', '9,900'),
    ('T-44-100', 'Советский средний премиум-танк', '/img/T-44-100.jpg', '10,000'),
    ('M41 90 GF', 'Легкий премиум-танк Германии', '/img/M41 90 GF.jpg', '8,700'),
    ('SU-130PM', 'Советская премиум ПТ-САУ', '/img/SU-130PM.jpg', '10,200'),
    ('FV4202', 'Британский средний премиум-танк', '/img/FV4202.jpg', '8,900'),
    ('E 75 TS', 'Немецкий тяжелый премиум-танк', '/img/E 75 TS.jpg', '12,000'),
    ('T-54 First Prototype', 'Советский средний премиум-танк', '/img/T-54 First Prototype.jpg', '9,500'),
    ('Chrysler K', 'Американский тяжелый премиум-танк', '/img/Chrysler K.jpg', '11,200'),
    ('IS-3A', 'Советский тяжелый премиум-танк', '/img/IS-3A.jpg', '12,700'),
    ('VK 168.01 P', 'Немецкий тяжелый премиум-танк', '/img/VK 168.01 P.jpg', '11,800'),
    ('T77', 'Американский тяжелый премиум-танк', '/img/T77.jpg', '12,300'),
    ('WZ-120G FT', 'Китайская премиум ПТ-САУ', '/img/WZ-120G FT.jpg', '11,600'),
    ('Somua SM', 'Французский тяжелый премиум-танк', '/img/Somua SM.jpg', '12,500'),
    ('Bourrasque', 'Французский средний премиум-танк', '/img/Bourrasque.jpg', '10,900');


insert into news
    (title, content, date)
values
    ('Новый танк ИС-6 доступен!', 'Советский тяжелый танк ИС-6 теперь в продаже!', '2025-02-20'),
    ('Обновление 1.24 вышло!', 'В обновлении улучшен баланс, добавлены новые карты и танки.', '2025-02-20'),
    ('Скидки на премиум технику!', 'До конца недели скидки до 50% на премиум танки.', '2025-02-18'),
    ('Зимний ивент начался!', 'Прими участие в уникальном зимнем событии и получи подарки.', '2025-02-15'),
    ('Новый режим "Бой на выживание"', 'Добавлен новый режим, в котором выживает только один.', '2025-02-10'),
    ('Обновлены карты!', 'На картах добавлены новые детали и улучшена графика.', '2025-02-05'),
    ('Премиум аккаунт со скидкой!', 'Сейчас можно купить премиум аккаунт со скидкой 30%.', '2025-02-02'),
    ('Ребаланс техники!', 'Некоторые танки получили улучшенные характеристики.', '2025-01-28'),
    ('Ремонт техники стал дешевле!', 'Теперь ремонт танков после боя обходится на 20% дешевле.', '2025-01-25'),
    ('Сезонный пропуск 2025!', 'В премиум-магазине доступен новый сезонный пропуск с эксклюзивными наградами.', '2025-01-20');
